Notflyabird/stm32_Bootload_UDS/Core/Src/can.c
/* USER CODE BEGIN Header */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "can.h"

/* USER CODE BEGIN 0 */
#include "stm32f103xe.h"
#include "stm32f1xx_hal.h"
#include "usart.h"
#include "uds_port.h"
#include "uds_service.h"

uint32_t rx_id=0;       // Received ID
uint32_t tx_id=0;       // Reply ID (rx_id + 1)
uint8_t rx_data[8];   // Receive data buffer
uint8_t rx_len=0;       // Receive data length

/* USER CODE END 0 */

CAN_HandleTypeDef hcan;

/* CAN init function */
void MX_CAN_Init(void)
{

  /* USER CODE BEGIN CAN_Init 0 */
  /* USER CODE END CAN_Init 0 */

  /* USER CODE BEGIN CAN_Init 1 */
  /* USER CODE END CAN_Init 1 */
  hcan.Instance = CAN1;
  // ========== 500kbit/s core configuration (36MHz APB1) ==========
  hcan.Init.Prescaler = 9;                // Prescaler: 9
  hcan.Init.Mode = CAN_MODE_NORMAL;       // Normal mode (non-loopback)
  hcan.Init.SyncJumpWidth = CAN_SJW_1TQ;  // SJW=1TQ
  hcan.Init.TimeSeg1 = CAN_BS1_6TQ;       // BS1=6TQ
  hcan.Init.TimeSeg2 = CAN_BS2_1TQ;       // BS2=1TQ
  // ========== Stability configuration ==========
  hcan.Init.TimeTriggeredMode = DISABLE;
  hcan.Init.AutoBusOff = ENABLE;          // Auto recovery after bus off
  hcan.Init.AutoWakeUp = DISABLE;
  hcan.Init.AutoRetransmission = ENABLE;  // Enable auto retransmission (critical)
  hcan.Init.ReceiveFifoLocked = DISABLE;
  hcan.Init.TransmitFifoPriority = DISABLE;
  if (HAL_CAN_Init(&hcan) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN CAN_Init 2 */
  CAN_Filter_Config();
  /* USER CODE END CAN_Init 2 */

}

void HAL_CAN_MspInit(CAN_HandleTypeDef* canHandle)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if(canHandle->Instance==CAN1)
  {
  /* USER CODE BEGIN CAN1_MspInit 0 */
  /* USER CODE END CAN1_MspInit 0 */
    /* CAN1 clock enable */
    __HAL_RCC_CAN1_CLK_ENABLE();

    __HAL_RCC_GPIOA_CLK_ENABLE();
    /**CAN GPIO Configuration
    PA11     ------> CAN_RX
    PA12     ------> CAN_TX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_12;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* CAN1 interrupt Init (keep if interrupt reception is needed) */
    HAL_NVIC_SetPriority(USB_LP_CAN1_RX0_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
    HAL_NVIC_SetPriority(CAN1_RX1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
  /* USER CODE BEGIN CAN1_MspInit 1 */
  /* USER CODE END CAN1_MspInit 1 */
  }
}

void HAL_CAN_MspDeInit(CAN_HandleTypeDef* canHandle)
{

  if(canHandle->Instance==CAN1)
  {
  /* USER CODE BEGIN CAN1_MspDeInit 0 */
  /* USER CODE END CAN1_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_CAN1_CLK_DISABLE();

    /**CAN GPIO Configuration
    PA11     ------> CAN_RX
    PA12     ------> CAN_TX
    */
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_11|GPIO_PIN_12);

    /* CAN1 interrupt Deinit */
    HAL_NVIC_DisableIRQ(USB_LP_CAN1_RX0_IRQn);
    HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
  /* USER CODE BEGIN CAN1_MspDeInit 1 */
  /* USER CODE END CAN1_MspDeInit 1 */
  }
}

/* USER CODE BEGIN 1 */

// Simplified CAN filter configuration: no ID filtering, receive all standard frames directly
void CAN_Filter_Config(void)
{
  CAN_FilterTypeDef CAN_FilterInitStructure;
  
  CAN_FilterInitStructure.FilterBank = 0;
  CAN_FilterInitStructure.FilterMode = CAN_FILTERMODE_IDMASK;
  CAN_FilterInitStructure.FilterScale = CAN_FILTERSCALE_32BIT;
  CAN_FilterInitStructure.FilterIdHigh = 0x0000;
  CAN_FilterInitStructure.FilterIdLow = 0x0000;
  CAN_FilterInitStructure.FilterMaskIdHigh = 0x0000;
  CAN_FilterInitStructure.FilterMaskIdLow = 0x0000;
  CAN_FilterInitStructure.FilterFIFOAssignment = CAN_RX_FIFO0;
  CAN_FilterInitStructure.FilterActivation = ENABLE;
  CAN_FilterInitStructure.SlaveStartFilterBank = 14;
  
  if(HAL_CAN_ConfigFilter(&hcan, &CAN_FilterInitStructure) != HAL_OK)
  {
    Error_Handler();
  }
  
  // Start CAN peripheral
  if(HAL_CAN_Start(&hcan) != HAL_OK)
  {
    Error_Handler();
  }
  
  // Enable FIFO0 receive interrupt (triggered when data arrives)
  if(HAL_CAN_ActivateNotification(&hcan, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK)
  {
    Error_Handler();
  }
}

// (Continuing from the filter configuration and receive function above)
uint8_t CAN_Receive_Message(uint32_t *id, uint8_t *data, uint8_t *len)
{
  // Function implementation
  CAN_RxHeaderTypeDef RxHeader;
  if(id == NULL || data == NULL || len == NULL)
    return 0;
  if(HAL_CAN_GetRxMessage(&hcan, CAN_RX_FIFO0, &RxHeader, data) != HAL_OK)
    return 0;
  *id = RxHeader.StdId;
  *len = RxHeader.DLC;
  return 1;
}

uint8_t CAN_Send_Message(uint32_t id, uint8_t *data, uint8_t len)
{
CAN_TxHeaderTypeDef TxHeader;
uint32_t TxMailbox;


TxHeader.StdId = id;
TxHeader.ExtId = 0;
TxHeader.IDE = CAN_ID_STD;
TxHeader.RTR = CAN_RTR_DATA;
TxHeader.DLC = len;
TxHeader.TransmitGlobalTime = DISABLE;

if (HAL_CAN_GetTxMailboxesFreeLevel(&hcan) == 0)
{
    HAL_Delay(1);
}

if (HAL_CAN_AddTxMessage(&hcan, &TxHeader, data, &TxMailbox) != HAL_OK)
{
    Error_Handler();
}
}



void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan)
{
  if(CAN_Receive_Message(&rx_id, rx_data, &rx_len) != 1)
  {
    return; // reception failed, return directly
  }
  // HAL_UART_Transmit(&huart1, rx_data, rx_len, 0xFFFF);

  // 2. Calculate reply ID (original ID+1, limited to standard frame range)
  tx_id = rx_id + 1;
  if(tx_id > 0x7FF)    // Standard frame ID max is 0x7FF (11 bits)
  {
    tx_id = 0x7FF;     // Force to maximum value when out of range
  }
  
  uds_recv_frame(rx_id, rx_data, 8);
  // Add error handling for failed transmission here if needed (e.g., retry), can be ignored in simplified scenarios
}


uint8_t can_start_check(void)
{
  uint8_t times = 5u;
  uint8_t Status = 0;
  while (times--)
  {
    HAL_Delay(1);
    if(rx_data[0] == 0x02 && rx_data[1] == 0x10 && rx_data[2] == 0x02) // Example data check
    {
      return Status = 1; // Condition met, set result to success
      break;
    }
  }
  return  Status;
}
/* USER CODE END 1 */
